function [EF XS1] = energy( xs1, H, spec , now)
%Η συναρτηση δεχεται ως ορισματα τον πινακα xs1 που σε καθε γραμμη περιεχει
%τα παραθυρωμενα πλαισια της εκφωνησης, τον πινακα Η που σε καθε γραμμη
%περιεχει εαν απο τα mel φιλτρα της συστοιχιας, την τιμη spec που ειναι το
%συνολο των σημειων που θελουμε για τον fft, και την τιμη now που ειναι το
%πληθος των παραθυρωμενων πλαισιων. Στην εξοδο επιστρεφει τον πινακα ΕF που
%σε καθε γραμμη του περιεχει τις υπολογιζομενες ενεργειες για το αντιστοιχο
%παραθυρο και τον πινακα XS1 που σε καθε γραμμη περιεχει τον DFT του
%αντιστοιχου παραθυρου.


m = size(xs1,1);        
XS1 = fft(xs1',spec)'; 
FS = zeros(size(XS1));  
EF = zeros(now,24);

for j = 1:24
    for i = 1:m
        FS(i,:) = XS1(i,:).*H(j,:);
        EF(i,j) = sum((abs(FS(i,:)').^2));
    end
end

