function [ E_hat ] = dct_reconstruct( C , j, now)
%Η συναρτηση αυτη δεχεται τον πινακα C που περιεχει τους DCT συνελεστες,
%την τιμη j που ειναι το πληθος των συντελεστων ενεργειας που θελουμε να
%εκτιμηθουν σε καθε παραθυρο, την τιμη now που ειναι το πληθος των
%παραθυροποιημενων πλαισιων ,και επιστρεφει τον πινακα Ε_hat που σε καθε
%γραμμη περιεχει την εκτίμηση των συντελεστών ενέργειας του αντιστοιχου
%παραθυρου

E_hat = zeros(now,j);

    for i = 1:now
        E_hat(i,:) = 10.^(idct(C(i,:),j));
    end
    
end

